#Область ПрограммныйИнтерфейс

Процедура ЗарегистрироватьДобавлениеОбъекта(ОбъектСсылка) Экспорт 
	
	МенеджерЗаписи = РегистрыСведений.ЛК_ОчередьОбменаСЛКСсылочнымиДанными.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = ОбъектСсылка;
	МенеджерЗаписи.ВидСобытия = Перечисления.ЛК_ВидыСобытийСОбъектамиЛК.Добавление;
	МенеджерЗаписи.Статус = Перечисления.ЛК_СтатусОбменаСЛК.Новый;
	МенеджерЗаписи.ДатаСобытия = ТекущаяДата();
	МенеджерЗаписи.Записать();
		
КонецПроцедуры

Процедура ЗарегистрироватьИзменениеОбъекта(ОбъектСсылка) Экспорт 
	
	МенеджерЗаписи = РегистрыСведений.ЛК_ОчередьОбменаСЛКСсылочнымиДанными.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = ОбъектСсылка;
	МенеджерЗаписи.ВидСобытия = Перечисления.ЛК_ВидыСобытийСОбъектамиЛК.Изменение;
	МенеджерЗаписи.Статус = Перечисления.ЛК_СтатусОбменаСЛК.Новый;
	МенеджерЗаписи.ДатаСобытия = ТекущаяДата();
	МенеджерЗаписи.Записать();
		
КонецПроцедуры

Процедура ЗарегистрироватьОшибкуОбработки(ОбъектСсылка, ВидСобытия) Экспорт 
	
	МенеджерЗаписи = РегистрыСведений.ЛК_ОчередьОбменаСЛКСсылочнымиДанными.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = ОбъектСсылка;
	МенеджерЗаписи.ВидСобытия = Перечисления.ЛК_ВидыСобытийСОбъектамиЛК.Изменение;
	МенеджерЗаписи.Статус = Перечисления.ЛК_СтатусОбменаСЛК.Ошибка;
	МенеджерЗаписи.ДатаСобытия = ТекущаяДата();
	МенеджерЗаписи.Записать();
		
КонецПроцедуры

Процедура ЗарегистрироватьУспехОбработки(ОбъектСсылка, ВидСобытия) Экспорт 
	
	МенеджерЗаписи = РегистрыСведений.ЛК_ОчередьОбменаСЛКСсылочнымиДанными.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = ОбъектСсылка;
	МенеджерЗаписи.ВидСобытия = Перечисления.ЛК_ВидыСобытийСОбъектамиЛК.Изменение;
	МенеджерЗаписи.Статус = Перечисления.ЛК_СтатусОбменаСЛК.Выполнен;
	МенеджерЗаписи.ДатаСобытия = ТекущаяДата();
	МенеджерЗаписи.Записать();
		
КонецПроцедуры

#КонецОбласти