#Область ПрограммныйИнтерфейс

Функция НастройкиСервиса() Экспорт 
	
	СтруктураВозврата = ЛК_РаботаСФункциями.СтруктураВозврата();
	СтруктураРезультата = Новый Структура("АдресСервера, ЛогинПользователя, ПарольПользователя");
	ВыборкаЗаписей = РегистрыСведений.ЛК_НастройкиСервисов.Выбрать();
		
	Если ВыборкаЗаписей.Следующий() Тогда
		СтруктураРезультата.Вставить("АдресСервера",       ВыборкаЗаписей.АдресСервера);
		СтруктураРезультата.Вставить("ЛогинПользователя",  ВыборкаЗаписей.ЛогинПользователя);
		СтруктураРезультата.Вставить("ПарольПользователя", ВыборкаЗаписей.ПарольПользователя);
		СтруктураРезультата.Вставить("ИДБазы",             ВыборкаЗаписей.ИДБазы);
	Иначе 
		ЛК_РаботаСФункциями.ДобавитьОшибку(СтруктураВозврата, "Не найдены настройки сервиса");
	КонецЕсли;	
	
	ЛК_РаботаСФункциями.ДобавитьРезультат(СтруктураВозврата, СтруктураРезультата);
	
	Возврат СтруктураВозврата;
	
КонецФункции	

#КонецОбласти
