#Область ПрограммныйИнтерфейс

#Область РегистрацияДанных

Процедура ЗарегистрироватьДобавлениеОбъекта(ОбъектСсылка) Экспорт 
	
	ИмяМетаданных = ОбъектСсылка.Метаданные().Имя;
	Объект = СтрШаблон(	"{name: ""%1"", object: ""%2""}", 
						ИмяМетаданных, 
						Строка(ОбъектСсылка.УникальныйИдентификатор()));
	
	МенеджерЗаписи             = РегистрыСведений.ЛК_ОчередьОбменаСЛКСсылочнымиДанными.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект      = ОбъектСсылка;
	МенеджерЗаписи.ВидСобытия  = Перечисления.ЛК_ВидыСобытийСОбъектамиЛК.Добавление;
	МенеджерЗаписи.Статус      = Перечисления.ЛК_СтатусОбменаСЛК.Новый;
	МенеджерЗаписи.ДатаСобытия = ТекущаяДатаСеанса();
	
	Попытка
		МенеджерЗаписи.Записать();
		
		ЛК_Логирование.ДобавитьЗаписьВЛог(	ЛК_ОбменДаннымиПовтИсп.УровниЛога().Дебаг, 
											ЛК_ОбменДаннымиПовтИсп.СобытияЛога().РегистрацияЗаданияОчередиОбмена, 
											ЛК_ОбменДаннымиПовтИсп.УровниСобытийЛога().Информация,
											ЛК_Логирование.ДанныеJSONОбъектJSON(ЛК_Логирование.ТекущаяДатаЛК(),
																				,
																				ЛК_ОбменДаннымиПовтИсп.ТипыОбъектов().СпрС, 
																				ИмяМетаданных,
																				Объект, 
																				"РегистрыСведений.ЛК_ОчередьОбменаСЛКСсылочнымиДанными.ЗарегистрироватьДобавлениеОбъекта"));
	Исключение
		ЛК_Логирование.ДобавитьЗаписьВЛог(	ЛК_ОбменДаннымиПовтИсп.УровниЛога().Ошибка, 
											ЛК_ОбменДаннымиПовтИсп.СобытияЛога().РегистрацияЗаданияОчередиОбмена, 
											ЛК_ОбменДаннымиПовтИсп.УровниСобытийЛога().Ошибка,
											ЛК_Логирование.ДанныеJSONОбъектJSON(ЛК_Логирование.ТекущаяДатаЛК(),
																				,
																				ЛК_ОбменДаннымиПовтИсп.ТипыОбъектов().СпрС, 
																				ИмяМетаданных,
																				Объект, 
																				"РегистрыСведений.ЛК_ОчередьОбменаСЛКСсылочнымиДанными.ЗарегистрироватьДобавлениеОбъекта",
																				ОписаниеОшибки()));
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗарегистрироватьИзменениеОбъекта(ОбъектСсылка) Экспорт 
	
	ИмяМетаданных = ОбъектСсылка.Метаданные().Имя;
	Объект = СтрШаблон(	"{name: ""%1"", object: ""%2""}", 
						ИмяМетаданных, 
						Строка(ОбъектСсылка.УникальныйИдентификатор()));
	
	
	МенеджерЗаписи             = РегистрыСведений.ЛК_ОчередьОбменаСЛКСсылочнымиДанными.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект      = ОбъектСсылка;
	МенеджерЗаписи.ВидСобытия  = Перечисления.ЛК_ВидыСобытийСОбъектамиЛК.Изменение;
	МенеджерЗаписи.Статус      = Перечисления.ЛК_СтатусОбменаСЛК.Новый;
	МенеджерЗаписи.ДатаСобытия = ТекущаяДатаСеанса();
	
	Попытка		
		МенеджерЗаписи.Записать();
		
		ЛК_Логирование.ДобавитьЗаписьВЛог(	ЛК_ОбменДаннымиПовтИсп.УровниЛога().Дебаг, 
											ЛК_ОбменДаннымиПовтИсп.СобытияЛога().РегистрацияЗаданияОчередиОбмена, 
											ЛК_ОбменДаннымиПовтИсп.УровниСобытийЛога().Информация,
											ЛК_Логирование.ДанныеJSONОбъектJSON(ЛК_Логирование.ТекущаяДатаЛК(),
																				,
																				ЛК_ОбменДаннымиПовтИсп.ТипыОбъектов().СпрС, 
																				ИмяМетаданных,
																				Объект, 
																				"РегистрыСведений.ЛК_ОчередьОбменаСЛКСсылочнымиДанными.ЗарегистрироватьИзменениеОбъекта"));
	Исключение
		ЛК_Логирование.ДобавитьЗаписьВЛог(	ЛК_ОбменДаннымиПовтИсп.УровниЛога().Ошибка, 
											ЛК_ОбменДаннымиПовтИсп.СобытияЛога().РегистрацияЗаданияОчередиОбмена, 
											ЛК_ОбменДаннымиПовтИсп.УровниСобытийЛога().Ошибка,
											ЛК_Логирование.ДанныеJSONОбъектJSON(ЛК_Логирование.ТекущаяДатаЛК(),
																				ЛК_ОбменДаннымиПовтИсп.ТипыОбъектов().СпрС,
																				ИмяМетаданных,
																				Объект, 
																				"РегистрыСведений.ЛК_ОчередьОбменаСЛКСсылочнымиДанными.ЗарегистрироватьИзменениеОбъекта",
																				ОписаниеОшибки()));
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область ИзменениеСтатуса

Процедура ЗарегистрироватьОшибкуОбработки(ИД, ОбъектСсылка, ВидСобытия, МестоВозникновения = "", Ошибка = "") Экспорт 
	
	ИмяМетаданных = ОбъектСсылка.Метаданные().Имя;
	Объект = СтрШаблон(	"{name: ""%1"", object: ""%2""}", 
						ИмяМетаданных, 
						Строка(ОбъектСсылка.УникальныйИдентификатор()));
	
	МенеджерЗаписи             = РегистрыСведений.ЛК_ОчередьОбменаСЛКСсылочнымиДанными.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект      = ОбъектСсылка;
	МенеджерЗаписи.ВидСобытия  = Перечисления.ЛК_ВидыСобытийСОбъектамиЛК.Изменение;
	МенеджерЗаписи.Статус      = Перечисления.ЛК_СтатусОбменаСЛК.Ошибка;
	МенеджерЗаписи.ДатаСобытия = ТекущаяДатаСеанса();
	
	Попытка	
		МенеджерЗаписи.Записать();
		
		ЛК_Логирование.ДобавитьЗаписьВЛог(	ЛК_ОбменДаннымиПовтИсп.УровниЛога().Ошибка, 
											ЛК_ОбменДаннымиПовтИсп.СобытияЛога().ОшибкаОбработкиОчередиОбмена, 
											ЛК_ОбменДаннымиПовтИсп.УровниСобытийЛога().Ошибка,
											ЛК_Логирование.ДанныеJSONОбъектJSON(ЛК_Логирование.ТекущаяДатаЛК(),
																				ИД,
																				ЛК_ОбменДаннымиПовтИсп.ТипыОбъектов().СпрС, 
																				ИмяМетаданных,
																				Объект, 
																				МестоВозникновения,
																				Ошибка));
	Исключение
		ЛК_Логирование.ДобавитьЗаписьВЛог(	ЛК_ОбменДаннымиПовтИсп.УровниЛога().Ошибка, 
											ЛК_ОбменДаннымиПовтИсп.СобытияЛога().ОшибкаОбработкиОчередиОбмена, 
											ЛК_ОбменДаннымиПовтИсп.УровниСобытийЛога().Ошибка,
											ЛК_Логирование.ДанныеJSONОбъектJSON(ЛК_Логирование.ТекущаяДатаЛК(),
																				ИД,
																				ЛК_ОбменДаннымиПовтИсп.ТипыОбъектов().СпрС, 
																				ИмяМетаданных,
																				Объект, 
																				"РегистрыСведений.ЛК_ОчередьОбменаСЛКСсылочнымиДанными.ЗарегистрироватьОшибкуОбработки",
																				ОписаниеОшибки()));
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗарегистрироватьУспехОбработки(ИД, ОбъектСсылка, ВидСобытия) Экспорт 
	
	ИмяМетаданных = ОбъектСсылка.Метаданные().Имя;
	Объект = СтрШаблон(	"{name: ""%1"", object: ""%2""}", 
						ИмяМетаданных, 
						Строка(ОбъектСсылка.УникальныйИдентификатор()));
	
	МенеджерЗаписи             = РегистрыСведений.ЛК_ОчередьОбменаСЛКСсылочнымиДанными.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект      = ОбъектСсылка;
	МенеджерЗаписи.ВидСобытия  = Перечисления.ЛК_ВидыСобытийСОбъектамиЛК.Изменение;
	МенеджерЗаписи.Статус      = Перечисления.ЛК_СтатусОбменаСЛК.Выполнен;
	МенеджерЗаписи.ДатаСобытия = ТекущаяДатаСеанса();
	
	Попытка
		МенеджерЗаписи.Записать();
		
		ЛК_Логирование.ДобавитьЗаписьВЛог(	ЛК_ОбменДаннымиПовтИсп.УровниЛога().Дебаг, 
											ЛК_ОбменДаннымиПовтИсп.СобытияЛога().РегистрацияЗаданияОчередиОбмена, 
											ЛК_ОбменДаннымиПовтИсп.УровниСобытийЛога().Информация,
											ЛК_Логирование.ДанныеJSONОбъектJSON(ЛК_Логирование.ТекущаяДатаЛК(),
																				ИД, 
																				ЛК_ОбменДаннымиПовтИсп.ТипыОбъектов().СпрС,
																				ИмяМетаданных,
																				Объект, 
																				"РегистрыСведений.ЛК_ОчередьОбменаСЛКСсылочнымиДанными.ЗарегистрироватьУспехОбработки"));
	Исключение
		ЛК_Логирование.ДобавитьЗаписьВЛог(	ЛК_ОбменДаннымиПовтИсп.УровниЛога().Ошибка, 
											ЛК_ОбменДаннымиПовтИсп.СобытияЛога().ОшибкаЛога, 
											ЛК_ОбменДаннымиПовтИсп.УровниСобытийЛога().Ошибка,
											ЛК_Логирование.ДанныеJSONОбъектJSON(ЛК_Логирование.ТекущаяДатаЛК(),
																				ИД, 
																				ЛК_ОбменДаннымиПовтИсп.ТипыОбъектов().СпрС,
																				ИмяМетаданных,
																				Объект, 
																				"РегистрыСведений.ЛК_ОчередьОбменаСЛКСсылочнымиДанными.ЗарегистрироватьУспехОбработки",
																				ОписаниеОшибки()));
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти