#Область ПрограммныйИнтерфейс

Функция МассивПользователейЛК() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛК_ПользователиЛК.ФизическоеЛицо КАК ФизическоеЛицо
	               |ИЗ
	               |	РегистрСведений.ЛК_ПользователиЛК КАК ЛК_ПользователиЛК";
	
	МассивПользователей = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо");
	
	Возврат МассивПользователей;
	
КонецФункции	

Функция УровниСобытийЛога() Экспорт
	
	Возврат ЛК_Логирование.УровниСобытийЛога();	

КонецФункции 

Функция СобытияЛога() Экспорт
	
	Возврат ЛК_Логирование.СобытияЛогаЛК();	

КонецФункции 

Функция УровниЛога() Экспорт
	
	Возврат ЛК_Логирование.УровниЛога();
	
КонецФункции

Функция ТипыОбъектов() Экспорт
	
	Возврат ЛК_Логирование.ТипыОбъектов();
	
КонецФункции

Функция МетодыЗапроса() Экспорт
	
	Структура = Новый Структура;
	Структура.Вставить("ГЕТ",  "GET");
	Структура.Вставить("ПОСТ", "POST");
	Структура.Вставить("ДЕЛ",  "DELETE");
	Структура.Вставить("ПУТ",  "PUT");
	
	Возврат Структура;
	
КонецФункции

#КонецОбласти