#Область ПрограммныйИнтерфейс

Функция НастройкиСервиса() Экспорт 
	
	СтруктураВозврата = ЛК_РаботаСФункциямиКлиентСервер.СтруктураВозврата();
	СтруктураРезультата = Новый Структура("АдресСервера, ЛогинПользователя, ПарольПользователя, ИДБазы, УровеньЛогирования");
	
	ВыборкаЗаписей = РегистрыСведений.ЛК_НастройкиСервисов.Выбрать();
	Если ВыборкаЗаписей.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураРезультата, ВыборкаЗаписей);
	Иначе 
		ЛК_РаботаСФункциямиКлиентСервер.ДобавитьОшибку(СтруктураВозврата, "Не найдены настройки сервиса");
	КонецЕсли;	
	
	ЛК_РаботаСФункциямиКлиентСервер.ДобавитьРезультат(СтруктураВозврата, СтруктураРезультата);
	
	Возврат СтруктураВозврата;
	
КонецФункции	

#КонецОбласти
