#Область ПрограммныйИнтерфейс

Процедура ПриНачалеРаботыСистемы() Экспорт 	
	
	Если РольДоступна("ЛК_Администратор") Тогда
		
		НайденныйЭлемент = Справочники.ЛК_СтатусыЗаявокНаСправки.НайтиПоКоду(2);
		Если Не ЗначениеЗаполнено(НайденныйЭлемент) Тогда

			НовыйЭлемент = Справочники.ЛК_СтатусыЗаявокНаСправки.СоздатьЭлемент();
			НовыйЭлемент.Наименование = "Новый";
			НовыйЭлемент.Код = 2;
			НовыйЭлемент.Записать();
			
			НовыйЭлемент = Справочники.ЛК_СтатусыЗаявокНаСправки.СоздатьЭлемент();
			НовыйЭлемент.Наименование = "В работе";
			НовыйЭлемент.Код = 3;
			НовыйЭлемент.Записать();

			НовыйЭлемент = Справочники.ЛК_СтатусыЗаявокНаСправки.СоздатьЭлемент();
			НовыйЭлемент.Наименование = "Отменена";
			НовыйЭлемент.Код = 4;
			НовыйЭлемент.Записать();
			
			НовыйЭлемент = Справочники.ЛК_СтатусыЗаявокНаСправки.СоздатьЭлемент();
			НовыйЭлемент.Наименование = "Выполнена";
			НовыйЭлемент.Код = 5;
			НовыйЭлемент.Записать();
			
		КонецЕсли;	
		
		НайденныйЭлемент = Справочники.ЛК_ТипыСправок.НайтиПоКоду(1);
		Если Не ЗначениеЗаполнено(НайденныйЭлемент) Тогда

			НовыйЭлемент = Справочники.ЛК_ТипыСправок.СоздатьЭлемент();
			НовыйЭлемент.Наименование = "НДФЛ";
			НовыйЭлемент.Код = 1;
			НовыйЭлемент.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры	

#КонецОбласти
