#Область ПрограммныйИнтерфейс

Процедура ЗарегистрироватьДобавлениеОбъекта(Описание, ХЭШ, Данные) Экспорт 
	
	МенеджерЗаписи = РегистрыСведений.ЛК_ОчередьОбменаСЛКПроизвольнымиДанными.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Описание = Описание;
	МенеджерЗаписи.ВидСобытия = Перечисления.ЛК_ВидыСобытийСОбъектамиЛК.Добавление;
	МенеджерЗаписи.ХЭШ = ХЭШ;
	МенеджерЗаписи.Статус = Перечисления.ЛК_СтатусОбменаСЛК.Новый;
	МенеджерЗаписи.Данные = Данные;
	МенеджерЗаписи.ДатаСобытия = ТекущаяДата();
	МенеджерЗаписи.Записать();
		
КонецПроцедуры

Процедура ЗарегистрироватьИзменениеОбъекта(Описание, ХЭШ, Данные) Экспорт 
	
	МенеджерЗаписи = РегистрыСведений.ЛК_ОчередьОбменаСЛКПроизвольнымиДанными.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Описание = Описание;
	МенеджерЗаписи.ВидСобытия = Перечисления.ЛК_ВидыСобытийСОбъектамиЛК.Изменение;
	МенеджерЗаписи.ХЭШ = ХЭШ;
	МенеджерЗаписи.Статус = Перечисления.ЛК_СтатусОбменаСЛК.Новый;
	МенеджерЗаписи.Данные = Данные;
	МенеджерЗаписи.ДатаСобытия = ТекущаяДата();
	МенеджерЗаписи.Записать();
		
КонецПроцедуры

Процедура ЗарегистрироватьУдалениеОбъекта(Описание, ХЭШ, Данные) Экспорт 
	
	МенеджерЗаписи = РегистрыСведений.ЛК_ОчередьОбменаСЛКПроизвольнымиДанными.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Описание = Описание;
	МенеджерЗаписи.ВидСобытия = Перечисления.ЛК_ВидыСобытийСОбъектамиЛК.Удаление;
	МенеджерЗаписи.ХЭШ = ХЭШ;
	МенеджерЗаписи.Статус = Перечисления.ЛК_СтатусОбменаСЛК.Новый;
	МенеджерЗаписи.Данные = Данные;
	МенеджерЗаписи.ДатаСобытия = ТекущаяДата();
	МенеджерЗаписи.Записать();
		
КонецПроцедуры

Процедура ЗарегистрироватьОшибкуОбработки(Описание, ХЭШ, Данные, ВидСобытия) Экспорт 
	
	МенеджерЗаписи = РегистрыСведений.ЛК_ОчередьОбменаСЛКПроизвольнымиДанными.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Описание = Описание;
	МенеджерЗаписи.ВидСобытия = ВидСобытия;
	МенеджерЗаписи.ХЭШ = ХЭШ;
	МенеджерЗаписи.Статус = Перечисления.ЛК_СтатусОбменаСЛК.Новый;
	МенеджерЗаписи.Данные = Данные;
	МенеджерЗаписи.ДатаСобытия = ТекущаяДата();
	МенеджерЗаписи.Записать();

		
КонецПроцедуры

Процедура ЗарегистрироватьУспехОбработки(Описание, ХЭШ, Данные, ВидСобытия) Экспорт 
	
	МенеджерЗаписи = РегистрыСведений.ЛК_ОчередьОбменаСЛКПроизвольнымиДанными.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Описание = Описание;
	МенеджерЗаписи.ВидСобытия = ВидСобытия;
	МенеджерЗаписи.ХЭШ = ХЭШ;
	МенеджерЗаписи.Статус = Перечисления.ЛК_СтатусОбменаСЛК.Выполнен;
	МенеджерЗаписи.Данные = Данные;
	МенеджерЗаписи.ДатаСобытия = ТекущаяДата();
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти